# StructuralCustomConnectionWrongType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralCustomConnectionFailures..::..StructuralCustomConnectionWrongType Property
BuiltInFailures..::..StructuralCustomConnectionFailures Class See Also
---
Structural Custom Connection has an inappropriate type assigned.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructuralCustomConnectionWrongType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralCustomConnectionWrongType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructuralCustomConnectionWrongType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralCustomConnectionFailures Class
Autodesk.Revit.DB Namespace